{
  "architectures": [
    "Qwen2ForCausalLM"
  ],
  "model_type": "qwen2",
  "hidden_act": "silu",
  "vocab_size": 24000,
  "hidden_size": 384,
  "num_hidden_layers": 6,
  "num_attention_heads": 6,
  "num_key_value_heads": 3,
  "rms_norm_eps": 1e-06,
  "rope_theta": 10000.0,
  "tie_word_embeddings": true,
  "max_position_embeddings": 2048,
  "intermediate_size": 2048
}